garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1579.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM1DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD94">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM1DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM1DCH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM1DCH" edc:desc="" edc:mask="0xff" edc:name="PWM1DCH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM1PR" edc:desc="" edc:name="PWM1PR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD95">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM1PRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD95">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM1PRL0" edc:desc="" edc:mask="0x1" edc:name="PWM1PRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRL1" edc:desc="" edc:mask="0x1" edc:name="PWM1PRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRL2" edc:desc="" edc:mask="0x1" edc:name="PWM1PRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRL3" edc:desc="" edc:mask="0x1" edc:name="PWM1PRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRL4" edc:desc="" edc:mask="0x1" edc:name="PWM1PRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRL5" edc:desc="" edc:mask="0x1" edc:name="PWM1PRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRL6" edc:desc="" edc:mask="0x1" edc:name="PWM1PRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRL7" edc:desc="" edc:mask="0x1" edc:name="PWM1PRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM1PRL" edc:desc="" edc:mask="0xff" edc:name="PWM1PRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM1PRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD96">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM1PRH0" edc:desc="" edc:mask="0x1" edc:name="PWM1PRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRH1" edc:desc="" edc:mask="0x1" edc:name="PWM1PRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRH2" edc:desc="" edc:mask="0x1" edc:name="PWM1PRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRH3" edc:desc="" edc:mask="0x1" edc:name="PWM1PRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRH4" edc:desc="" edc:mask="0x1" edc:name="PWM1PRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRH5" edc:desc="" edc:mask="0x1" edc:name="PWM1PRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRH6" edc:desc="" edc:mask="0x1" edc:name="PWM1PRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PRH7" edc:desc="" edc:mask="0x1" edc:name="PWM1PRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM1PRH" edc:desc="" edc:mask="0xff" edc:name="PWM1PRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM1OF" edc:desc="" edc:name="PWM1OF" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD97">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1OFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM1OFL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD97">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM1OFL0" edc:desc="" edc:mask="0x1" edc:name="PWM1OFL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFL1" edc:desc="" edc:mask="0x1" edc:name="PWM1OFL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFL2" edc:desc="" edc:mask="0x1" edc:name="PWM1OFL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFL3" edc:desc="" edc:mask="0x1" edc:name="PWM1OFL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFL4" edc:desc="" edc:mask="0x1" edc:name="PWM1OFL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFL5" edc:desc="" edc:mask="0x1" edc:name="PWM1OFL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFL6" edc:desc="" edc:mask="0x1" edc:name="PWM1OFL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFL7" edc:desc="" edc:mask="0x1" edc:name="PWM1OFL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM1OFL" edc:desc="" edc:mask="0xff" edc:name="PWM1OFL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
